{
    "contest_id": "2121",
    "problem_index": "A",
    "title": "A. Letter Home",
    "description": "You are given an array of distinct integers x1,x2,…,xnx1,x2,…,xn and an integer ss. Initially, you are at position pos=spos=s on the XX axis. In one step, you can perform exactly one of the following two actions: Move from position pospos to position pos+1pos+1. Move from position pospos to position pos−1pos−1. A sequence of steps will be considered successful if, during the entire journey, you visit each position xixi on the XX axis at least once. Note that the initial position pos=spos=s is also considered visited. Your task is to determine the minimum number of steps in any successful sequence of steps.",
    "input": "InputEach test consists of multiple test cases. The first line contains a single integer tt (1≤t≤10001≤t≤1000) — the number of test cases. The description of the test cases follows.The first line of each test case contains two integers nn and ss (1≤n≤101≤n≤10, 1≤s≤1001≤s≤100) — the number of positions to visit and the starting position. The second line of each test case contains nn integers x1,x2,…,xnx1,x2,…,xn (1≤xi≤1001≤xi≤100). It is guaranteed that for all 1≤i<n1≤i<n, it holds that xi<xi+1xi<xi+1.",
    "output": "OutputFor each test case, output the minimum number of steps in any successful sequence of steps.",
    "example": "Example\nInput\nCopy\n12\n1 1\n1\n1 2\n1\n1 1\n2\n2 1\n2 3\n2 2\n1 3\n2 3\n1 2\n3 1\n1 2 3\n3 2\n1 3 4\n3 3\n1 2 3\n4 3\n1 2 3 10\n5 5\n1 2 3 6 7\n6 6\n1 2 3 9 10 11\nOutput\nCopy\n0\n1\n1\n2\n3\n2\n2\n4\n2\n11\n8\n15",
    "note": "NoteIn the first test case, no steps need to be taken, so the only visited position will be 11. In the second test case, the following path can be taken: 2→12→1. The number of steps is 11. In the third test case, the following path can be taken: 1→21→2. The number of steps is 11.In the fifth test case, the following path can be taken: 2→1→2→32→1→2→3. The number of steps is 33.",
    "tags": [
        "brute force",
        "math"
    ],
    "editorial_content": null
}