{
    "contest_id": "2114",
    "problem_index": "B",
    "title": "B. Not Quite a Palindromic String",
    "description": "Vlad found a binary string ∗ ∗ s s of even length n n . He considers a pair of indices ( i , n − i + 1 i , n − i + 1 ), where 1 ≤ i < n − i + 1 1 ≤ i < n − i + 1 , to be good if s i = s n − i + 1 s i = s n − i + 1 holds true. For example, in the string ' 010001 ' there is only 1 1 good pair, since s 1 ≠ s 6 s 1 ≠ s 6 , s 2 ≠ s 5 s 2 ≠ s 5 , and s 3 = s 4 s 3 = s 4 . In the string ' 0101 ' there are no good pairs. Vlad loves palindromes, but not too much, so he wants to rearrange some characters of the string so that there are exactly k k good pairs of indices. Determine whether it is possible to rearrange the characters in the given string so that there are exactly k k good pairs of indices ( i , n − i + 1 i , n − i + 1 ). ∗ ∗ A string s s is called binary if it consists only of the characters ' 0 ' and ' 1 '",
    "input": "Input The first line contains an integer t t ( 1 ≤ t ≤ 10 4 1 ≤ t ≤ 10 4 ) — the number of test cases. The first line of each test case contains two integers n n and k k ( 2 ≤ n ≤ 2 ⋅ 10 5 2 ≤ n ≤ 2 ⋅ 10 5 , 0 ≤ k ≤ n 2 0 ≤ k ≤ n 2 , n n is even) — the length of the string and the required number of good pairs. The second line of each test case contains a binary string s s of length n n . It is guaranteed that the sum of n n across all test cases does not exceed 2 ⋅ 10 5 2 ⋅ 10 5 .",
    "output": "Output For each test case, output \" YES \" if there is a way to rearrange the characters of the string so that there are exactly k k good pairs, otherwise output \" NO \". You may output each letter in any case (lowercase or uppercase). For example, the strings \" yEs \", \" yes \", \" Yes \", and \" YES \" will be accepted as a positive answer.",
    "example": "Example\nInput\nCopy\n6\n6 2\n000000\n2 1\n01\n4 1\n1011\n10 2\n1101011001\n10 1\n1101011001\n2 1\n11\nOutput\nCopy\nNO\nNO\nYES\nNO\nYES\nYES",
    "note": "",
    "tags": [
        "greedy",
        "math",
        "*900"
    ],
    "editorial_content": null
}