{
    "contest_id": "2102",
    "problem_index": "B",
    "title": "B. The Picky Cat",
    "description": "You are given an array of integers a 1 , a 2 , … , a n a 1 , a 2 , … , a n . You are allowed to do the following operation any number of times (possibly zero): Choose an index i i ( 1 ≤ i ≤ n 1 ≤ i ≤ n ). Multiply a i a i by − 1 − 1 (i.e., update a i := − a i a i : = − a i ). Your task is to determine whether it is possible to make the element at index 1 1 become the median of the array after doing the above operation any number of times. Note that operations can be applied to index 1 1 as well, meaning the median can be either the original value of a 1 a 1 or its negation. The median of an array b 1 , b 2 , … , b m b 1 , b 2 , … , b m is defined as the ⌈ m 2 ⌉ ⌈ m 2 ⌉ -th ∗ ∗ smallest element of array b b . For example, the median of the array [ 3 , 1 , 2 ] [ 3 , 1 , 2 ] is 2 2 , while the median of the array [ 10 , 1 , 8 , 3 ] [ 10 , 1 , 8 , 3 ] is 3 3 . It is guaranteed that the absolute value of the elements of a a are distinct. Formally, there are no pairs of indices 1 ≤ i < j ≤ n 1 ≤ i < j ≤ n where | a i | = | a j | | a i | = | a j | . ∗ ∗ ⌈ x ⌉ ⌈ x ⌉ is the ceiling function which returns the least integer greater than or equal to x x .",
    "input": "Input Each test contains multiple test cases. The first line contains the number of test cases t t ( 1 ≤ t ≤ 10 4 1 ≤ t ≤ 10 4 ). The description of the test cases follows. The first line of each test case contains a single integer n n ( 1 ≤ n ≤ 10 5 1 ≤ n ≤ 10 5 ) — the length of the array a a . The second line of each test case contains n n integers a 1 , a 2 , … , a n a 1 , a 2 , … , a n ( | a i | ≤ 10 6 | a i | ≤ 10 6 , | a i | ≠ | a j | | a i | ≠ | a j | ) — the elements of the array a a . It is guaranteed that the sum of n n over all test cases does not exceed 10 5 10 5 .",
    "output": "Output For each testcase, output \" YES \" if it is possible to make the element at index 1 1 become the median of the array, and \" NO \" otherwise. You can output the answer in any case (upper or lower). For example, the strings \" yEs \", \" yes \", \" Yes \", and \" YES \" will be recognized as positive responses.",
    "example": "Example\nInput\nCopy\n7\n3\n2 3 1\n5\n1 2 3 4 5\n4\n4 2 0 -5\n4\n-5 0 4 3\n4\n-10 8 3 2\n1\n1\n10\n9 1000 -999 -13 456 -223 23 24 10 0\nOutput\nCopy\nYES\nYES\nYES\nNO\nNO\nYES\nYES",
    "note": "Note In the first test case, a 1 = 2 a 1 = 2 is already the median of the array a = [ 2 , 3 , 1 ] a = [ 2 , 3 , 1 ] , so no operation is required. In the second test case, we can do two operations: one on index 2 2 , and one on index 5 5 . The array becomes [ 1 , − 2 , 3 , 4 , − 5 ] [ 1 , − 2 , 3 , 4 , − 5 ] , which has a median of 1 1 . In the third test case, if you do an operation on index 1 1 , the array will become [ − 4 , 2 , 0 , − 5 ] [ − 4 , 2 , 0 , − 5 ] , which has a median of − 4 − 4 . In the fourth test case, it can be proven that no sequence of operations can make the median of the array become 5 5 or − 5 − 5 .",
    "tags": [
        "implementation",
        "sortings",
        "*900"
    ],
    "editorial_content": null
}