{
    "contest_id": "1845",
    "problem_index": "C",
    "title": "C. Strong Password",
    "description": "Monocarp finally got the courage to register on ForceCoders. He came up with a handle but is still thinking about the password. He wants his password to be as strong as possible, so he came up with the following criteria: the length of the password should be exactly m m ; the password should only consist of digits from 0 0 to 9 9 ; the password should not appear in the password database (given as a string s s ) as a subsequence (not necessarily contiguous). Monocarp also came up with two strings of length m m : l l and r r , both consisting only of digits from 0 0 to 9 9 . He wants the i i -th digit of his password to be between l i l i and r i r i , inclusive. Does there exist a password that fits all criteria?",
    "input": "Input The first line contains a single integer t t ( 1 ≤ t ≤ 10 4 1 ≤ t ≤ 10 4 ) — the number of testcases. The first line of each testcase contains a string s s ( 1 ≤ | s | ≤ 3 ⋅ 10 5 1 ≤ | s | ≤ 3 ⋅ 10 5 ), consisting only of digits from 0 0 to 9 9 — the password database. The second line contains a single integer m m ( 1 ≤ m ≤ 10 1 ≤ m ≤ 10 ) — the required length of the password. The third line contains a string l l ( | l | = m | l | = m ), consisting only of digits from 0 0 to 9 9 — the lower restriction on each digit. The fourth line contains a string r r ( | r | = m | r | = m ), consisting only of digits from 0 0 to 9 9 — the upper restriction on each digit. l i ≤ r i l i ≤ r i for all i i from 1 1 to m m . The sum of lengths of s s over all testcases doesn't exceed 3 ⋅ 10 5 3 ⋅ 10 5 .",
    "output": "Output For each testcase, print \" YES \" if there exists a password that fits all criteria. Print \" NO \" otherwise.",
    "example": "Example\nInput\nCopy\n5\n88005553535123456\n2\n50\n56\n123412341234\n3\n111\n444\n1234\n4\n4321\n4321\n459\n2\n49\n59\n00010\n2\n10\n11\nOutput\nCopy\nYES\nNO\nYES\nNO\nYES",
    "note": "Note In the first testcase, Monocarp can choose password \" 50 \". It doesn't appear in s s as a subsequence. In the second testcase, all combinations of three digits, each of them being from 1 1 to 4 4 , fit the criteria on l l and r r . However, all of them appear in s s as subsequences. For example, \" 314 \" appears at positions [ 3 , 5 , 12 ] [ 3 , 5 , 12 ] and \" 222 \" appears at positions [ 2 , 6 , 10 ] [ 2 , 6 , 10 ] . In the third testcase, Monocarp can choose password \" 4321 \". Actually, that is the only password that fits the criteria on l l and r r . Luckily, it doesn't appear in s s as a subsequence. In the fourth testcase, only \" 49 \" and \" 59 \" fit the criteria on l l and r r . Both of them appear in s s as subsequences. In the fifth testcase, Monocarp can choose password \" 11 \".",
    "tags": [
        "binary search",
        "dp",
        "greedy",
        "strings",
        "*1400"
    ],
    "editorial_content": null
}